dlls/BingReviewsRequestTemplate.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SearchWithNifEnabled xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search"><request><Context xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><ApplicationId>%1</ApplicationId><UserId>%2</UserId><Version>%3</Version><Culture>%4</Culture></Context><Properties xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>Common.cxt</Key><Value>269582</Value></KeyValueOfstringstring><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>MsnRR.ypId</Key><Value>%5</Value></KeyValueOfstringstring><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>MsnRR.SortBy</Key><Value>Rating</Value></KeyValueOfstringstring><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>MsnRR.SortOrder</Key><Value>Desc</Value></KeyValueOfstringstring></Properties><Queries xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><QueryInformation><Domains><DomainInformation><Domain>RatingReview</Domain><Range><Count>%6</Count><Start>%7</Start></Range></DomainInformation></Domains></QueryInformation></Queries></request></SearchWithNifEnabled></soap:Body></soap:Envelope>